src/cf/Catalogs/МетодыРесурсовREST.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МетодыРесурсовREST</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.РесурсыREST</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетодЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыЗапросаREST</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикПользовательскаяФункция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеФункции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурыДанныхREST</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьАвторизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПользователя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаголовкиЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределениеОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурыДанныхREST</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределениеОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурыДанныхREST</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвращаемыеОтветы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОтвета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОтветовREST</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОтвета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОпределениеОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурыДанныхREST</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаголовкиОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КраткоеОписание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/МетодыРесурсовREST/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.Владелец.Вид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	УстановитьВидимость();
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ВидимостьПользовательскойФункции = ПолучитьЗначениеИспользуютсяПользовательскиеФункцииВСервисе(Объект.Владелец);
	Элементы.Обработчик.Видимость							= Не ВидимостьПользовательскойФункции;
	Элементы.ОбработчикПользовательскаяФункция.Видимость	= ВидимостьПользовательскойФункции;
	
КонецПроцедуры

&НаКлиенте
Процедура АвторизацияПриИзменении(Элемент)
	
	Объект.Доступ.Очистить();
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипДанныхПриИзменении(Элемент)
	
	Объект.ОпределениеОбъекта = Неопределено;
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвращаемыеОтветы

&НаКлиенте
Процедура ВозвращаемыеОтветыТипОтветаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВозвращаемыеОтветы.ТекущиеДанные;
	
	ЭлементСписка = ПользовательскиеВидыОтветов.НайтиПоЗначению(ТекущиеДанные.ТипОтвета);
	
	Если ЭлементСписка = Неопределено Тогда
		ТекущиеДанные.КодОтвета = 0;
	Иначе
		ТекущиеДанные.КодОтвета = Число(ЭлементСписка.Представление);
	КонецЕсли;
	
	Если Окр(ТекущиеДанные.КодОтвета / 100) <> 2 Тогда
		ТекущиеДанные.ТипДанных = "Строка";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьСтандартнымиОтветами(Команда)
	
	ЗаполнитьСтандартнымиОтветамиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтандартнымиОтветамиНаСервере()
	
	СтандартныеКодыОтвета = УправлениеRESTСервер.ПолучитьТаблицуСтандартныхКодовОтвета();
	
	Объект.ВозвращаемыеОтветы.Загрузить(СтандартныеКодыОтвета);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьСпискиВыбора()
	
	//
	ДоступныеТипыДанных = СпецификацияRESTСервер.ПолучитьДоступныеТипыДанныхПараметра();
	
	Элементы.ЗаголовкиЗапросаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ПараметрыЗапросаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ЗаголовкиОтветаТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	
	//
	ПользовательскиеВидыОтветов = ОбщегоНазначенияRESTСервер.ПолучитьПользовательскиеВидыОтветов();
	
	Элементы.ВозвращаемыеОтветыТипОтвета.СписокВыбора.ЗагрузитьЗначения(ПользовательскиеВидыОтветов.ВыгрузитьЗначения());
	
	//
	ДоступныеТипыДанных = СпецификацияRESTСервер.ПолучитьДоступныеТипыДанныхТела();
	
	Элементы.ТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);
	Элементы.ВозвращаемыеОтветыТипДанных.СписокВыбора.ЗагрузитьЗначения(ДоступныеТипыДанных);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ОпределениеОбъекта.Видимость = (Объект.ТипДанных = "Объект" Или Объект.ТипДанных = "Массив");
	
	Элементы.ГруппаДоступ.Видимость = (Объект.ЕстьАвторизация);
	
	ВидимостьПользовательскойФункции = ПолучитьЗначениеИспользуютсяПользовательскиеФункцииВСервисе(Объект.Владелец);
	Элементы.Обработчик.Видимость							= Не ВидимостьПользовательскойФункции;
	Элементы.ОбработчикПользовательскаяФункция.Видимость	= ВидимостьПользовательскойФункции;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеИспользуютсяПользовательскиеФункцииВСервисе(Ресурс)
	
	Возврат Ресурс.Владелец.ИспользуютсяПользовательскиеФункции;
	
КонецФункции

#КонецОбласти
